org/examples-06.org
#+include R-text-common.org
#+Title: 6章 例題
#+OPTIONS: tex:t 
#+property: header-args:R :session *rtext* :results output :exports both

* テントウ虫の種類

** 母集団の平均も分散も既知の場合の検定

  平均体長5mm, 母偏差2mm の正規母集団を仮定し，
  標本平均11mmのテントウ虫の珍しさは？
  
*** 標本の作成

#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

## 平均11mm, 標準偏差2mmの母集団からの標本の作成

(sample <- rnorm(n=10, mean=11, sd=2))

c(mean(sample), sqrt(var(sample)))

#+end_src

#+RESULTS:
:  [1]  7.598661 14.119082 11.917752  9.432214 10.906008 11.086925 11.030048
:  [8]  9.359998 12.343000 10.211734
: [1] 10.800542  1.805303

***  mean(sample) となる確率 (p値) を求める

#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

pnorm(mean(sample), mean=5, sd=2)

#+end_src

#+RESULTS:
: [1] 0.9989641

*** かなり確率が低い，新種では？

* 尿酸値検査と痛風

** 母集団の平均既知, 分散未知の場合の検定

  標準血糖値 7.0mg にたいし，
  標本平均11mの場合，痛風であるか？
  
*** 標本の作成

#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

(sample <- c(7, 10, 12, 13, 13))
c(mean(sample), var(sample), sqrt(var(sample)))

#+end_src

#+RESULTS:
: [1]  7 10 12 13 13
: [1] 11.00000  6.50000  2.54951

*** 臨界値を求める
#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

qt(0.975,df=length(sample)-1)

#+end_src
*** 検定量を求める

#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

(t_est <- (mean(sample) - 7)/sqrt(var(sample)/length(sample)))

#+end_src

#+RESULTS:
: [1] 3.508232

*** p-値を求める

#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

pt(t_est,df=length(sample)-1)

#+end_src

#+RESULTS:
: [1] 0.9876443

*** t 検定
#+begin_src R :session *rtext* :results output :exports both :tangle R-text/code/06.R

t.test(sample, mu=7)

#+end_src

#+RESULTS:
#+begin_example

	One Sample t-test

data:  sample
t = 3.5082, df = 4, p-value = 0.02471
alternative hypothesis: true mean is not equal to 7
95 percent confidence interval:
  7.834366 14.165634
sample estimates:
mean of x 
       11
#+end_example

*** かなり確率が低い，痛風である確率が高い


