org/examples-06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-22 水 22:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>6章 例題</title>
<meta name="author" content="Masayuki Suzuki" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">6章 例題</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc602857">1. テントウ虫の種類</a>
<ul>
<li><a href="#orgcfd7b51">1.1. 母集団の平均も分散も既知の場合の検定</a>
<ul>
<li><a href="#org06e4aff">1.1.1. 標本の作成</a></li>
<li><a href="#org08df1aa">1.1.2. mean(sample) となる確率 (p値) を求める</a></li>
<li><a href="#org3aa0c52">1.1.3. かなり確率が低い，新種では？</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7459649">2. 尿酸値検査と痛風</a>
<ul>
<li><a href="#orge2b164d">2.1. 母集団の平均既知, 分散未知の場合の検定</a>
<ul>
<li><a href="#org37cdea1">2.1.1. 標本の作成</a></li>
<li><a href="#org60fb457">2.1.2. 臨界値を求める</a></li>
<li><a href="#org99bfae9">2.1.3. 検定量を求める</a></li>
<li><a href="#org456c79e">2.1.4. p-値を求める</a></li>
<li><a href="#orgf606083">2.1.5. t 検定</a></li>
<li><a href="#org126bfb6">2.1.6. かなり確率が低い，痛風である確率が高い</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#+include R-text-common.org
</p>

<div id="outline-container-orgc602857" class="outline-2">
<h2 id="orgc602857"><span class="section-number-2">1.</span> テントウ虫の種類</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcfd7b51" class="outline-3">
<h3 id="orgcfd7b51"><span class="section-number-3">1.1.</span> 母集団の平均も分散も既知の場合の検定</h3>
<div class="outline-text-3" id="text-1-1">
<p>
平均体長5mm, 母偏差2mm の正規母集団を仮定し，
標本平均11mmのテントウ虫の珍しさは？
</p>
</div>

<div id="outline-container-org06e4aff" class="outline-4">
<h4 id="org06e4aff"><span class="section-number-4">1.1.1.</span> 標本の作成</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #99968b;">## </span><span style="color: #99968b;">&#24179;&#22343;11mm, &#27161;&#28310;&#20559;&#24046;2mm&#12398;&#27597;&#38598;&#22243;&#12363;&#12425;&#12398;&#27161;&#26412;&#12398;&#20316;&#25104;</span>

(sample <span style="color: #e5786d;">&lt;-</span> rnorm(n=10, mean=11, sd=2))

c(mean(sample), sqrt(var(sample)))

</pre>
</div>

<pre class="example">
 [1]  7.598661 14.119082 11.917752  9.432214 10.906008 11.086925 11.030048
 [8]  9.359998 12.343000 10.211734
[1] 10.800542  1.805303
</pre>
</div>
</div>

<div id="outline-container-org08df1aa" class="outline-4">
<h4 id="org08df1aa"><span class="section-number-4">1.1.2.</span> mean(sample) となる確率 (p値) を求める</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-R">
pnorm(mean(sample), mean=5, sd=2)

</pre>
</div>

<pre class="example">
[1] 0.9989641
</pre>
</div>
</div>

<div id="outline-container-org3aa0c52" class="outline-4">
<h4 id="org3aa0c52"><span class="section-number-4">1.1.3.</span> かなり確率が低い，新種では？</h4>
</div>
</div>
</div>

<div id="outline-container-org7459649" class="outline-2">
<h2 id="org7459649"><span class="section-number-2">2.</span> 尿酸値検査と痛風</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge2b164d" class="outline-3">
<h3 id="orge2b164d"><span class="section-number-3">2.1.</span> 母集団の平均既知, 分散未知の場合の検定</h3>
<div class="outline-text-3" id="text-2-1">
<p>
標準血糖値 7.0mg にたいし，
標本平均11mの場合，痛風であるか？
</p>
</div>

<div id="outline-container-org37cdea1" class="outline-4">
<h4 id="org37cdea1"><span class="section-number-4">2.1.1.</span> 標本の作成</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-R">
(sample <span style="color: #e5786d;">&lt;-</span> c(7, 10, 12, 13, 13))
c(mean(sample), var(sample), sqrt(var(sample)))

</pre>
</div>

<pre class="example">
[1]  7 10 12 13 13
[1] 11.00000  6.50000  2.54951
</pre>
</div>
</div>

<div id="outline-container-org60fb457" class="outline-4">
<h4 id="org60fb457"><span class="section-number-4">2.1.2.</span> 臨界値を求める</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-R">
qt(0.975,df=length(sample)-1)

</pre>
</div>
</div>
</div>
<div id="outline-container-org99bfae9" class="outline-4">
<h4 id="org99bfae9"><span class="section-number-4">2.1.3.</span> 検定量を求める</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-R">
(t_est <span style="color: #e5786d;">&lt;-</span> (mean(sample) - 7)/sqrt(var(sample)/length(sample)))

</pre>
</div>

<pre class="example">
[1] 3.508232
</pre>
</div>
</div>

<div id="outline-container-org456c79e" class="outline-4">
<h4 id="org456c79e"><span class="section-number-4">2.1.4.</span> p-値を求める</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-R">
pt(t_est,df=length(sample)-1)

</pre>
</div>

<pre class="example">
[1] 0.9876443
</pre>
</div>
</div>

<div id="outline-container-orgf606083" class="outline-4">
<h4 id="orgf606083"><span class="section-number-4">2.1.5.</span> t 検定</h4>
<div class="outline-text-4" id="text-2-1-5">
<div class="org-src-container">
<pre class="src src-R">
t.test(sample, mu=7)

</pre>
</div>

<pre class="example" id="org7df0ac0">

	One Sample t-test

data:  sample
t = 3.5082, df = 4, p-value = 0.02471
alternative hypothesis: true mean is not equal to 7
95 percent confidence interval:
  7.834366 14.165634
sample estimates:
mean of x 
       11
</pre>
</div>
</div>

<div id="outline-container-org126bfb6" class="outline-4">
<h4 id="org126bfb6"><span class="section-number-4">2.1.6.</span> かなり確率が低い，痛風である確率が高い</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2021-12-22 水 22:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
